---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopesError
source: html/4be81cba-8634-482c-7dcb-4acac60d166c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopesError Property

There is more than one slope defined.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManySlopesError { get; }
```